#include "led.h"


/*********************************************************************************
**********************MCU启明 STM32F407应用开发板(高配版)*************************
**********************************************************************************
* 文件名称: 例程1 LED跑马灯主函数main()                                          *
* 文件简述：LED跑马灯                                                            *
* 创建日期：2017.08.30                                                           *
* 版    本：V1.0                                                                 *
* 作    者：Clever                                                               *
* 说    明：                                                                     * 
* 声    明：本例程代码仅用于学习参考                                             *
**********************************************************************************
*********************************************************************************/

/*******************下面代码是通过位带操作实现IO口控制***************************/
int main(void)
{ 
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); //设置系统中断优先级分组2
	delay_init();		  //初始化延时函数
	LED_Init();		    //初始化LED端口
	
  while(1)
	{
    LED0=0;     //LED0亮
    LED1=1;     //LED1灭
    LED2=1;     //LED2灭
		
    delay_ms(500);
		LED0=1;     //LED0灭
    LED1=0;     //LED1亮
    LED2=1;     //LED2灭
		 
		delay_ms(500);
		LED0=1;     //LED0灭
    LED1=1;     //LED1灭
    LED2=0;     //LED2亮
    delay_ms(500);
	}
}




