#include "led.h"
#include "timer.h"
#include "lcd.h"
#include "beep.h"

/*********************************************************************************
**********************MCU启明 STM32F407应用开发板(高配版)*************************
**********************************************************************************
* 文件名称: 例程6 定时器中断主函数main.c                                         *
* 文件简述：定时器中断使用                                                       *
* 创建日期：2015.08.30                                                           *
* 版    本：V1.0                                                                 *
* 作    者：Clever                                                               *
* 说    明：利用定时器中断控制LED1亮灭与蜂鸣器响闭                               *
* 淘宝店铺：https://shop125046348.taobao.com                                     *
* 声    明：本例程代码仅用于学习参考                                             *
**********************************************************************************
*********************************************************************************/

int main(void)
{ 
 	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);//设置系统中断优先级分组2
	delay_init();          //初始化延时函数
	LED_Init();				     //初始化LED端口
	BEEP_Init();
	LCD_Init();
  BRUSH_COLOR=RED;      //设置画笔颜色为红色
	
 	TIM2_Init(4999,8399);	//定时器2时钟84M，分频系数8400，84M/8400=10K 所以计数5000次为500ms 

  LCD_DisplayString(10,10,24,"Illuminati STM32F4");	
  LCD_DisplayString(10,40,16,"Author:Clever");
	LCD_DisplayString(30,80,24,"6.TIMER TEST");	
	
	while(1)
	{
		LED0=!LED0;    //系统运行提示
		delay_ms(300);  
	}
}


