#ifndef __LUCALENDAR_H
#define __LUCALENDAR_H
#include "common.h"
/*********************************************************************************
*************************MCU启明 STM32F407核心开发板******************************
**********************************************************************************
* 文件名称: lucalendar.h                                                         *
* 文件简述：农历显示调用的函数                                                   *
* 创建日期：2015.03.15                                                           *
* 版    本：V1.0                                                                 *
* 作    者：Clever                                                               *
* 说    明：提供获取农历日期与节气日期两个接口函数                               * 
**********************************************************************************
*********************************************************************************/


void GetLunarCalendarStr(u16 year,u8 month,u8 day,u8 *str);

u8 GetJieQiStr(u16 year,u8 month,u8 day,u8 *str);


#endif 
