/*********************************************************************************
**********************MCUÆôÃ÷ STM32F407Ó¦ÓÃ¿ª·¢°å(¸ßÅä°æ)*************************
**********************************************************************************
* ÎÄ¼şÃû³Æ: UDP_SERVER.C                                                        *
* ÎÄ¼ş¼òÊö£ºUDP·şÎñÆ÷ÔËÓÃ                                                        *
* ´´½¨ÈÕÆÚ£º2015.10.08                                                           *
* °æ    ±¾£ºV1.0                                                                 *
* ×÷    Õß£ºClever                                                               *
* Ëµ    Ã÷£º                                                                     * 
**********************************************************************************
*********************************************************************************/
#include "stm32f4x7_eth.h"
#include "stm32f4x7_eth_bsp.h"
#include "netconf.h"
#include "tcp.h"
#include "udp.h"
#include "string.h"

#include "UDP_SERVER.h"


/****************************************************************************
* Ãû    ³Æ: udp_server_recv(void *arg, struct udp_pcb *pcb, struct pbuf *p,struct ip_addr *addr, u16_t port)
* ¹¦    ÄÜ£ºudpÊı¾İ½ÓÊÕºÍ·¢ËÍ
* Èë¿Ú²ÎÊı£º 
* ·µ»Ø²ÎÊı£º 
* Ëµ    Ã÷£ºÕâÊÇÒ»¸ö»Øµ÷º¯Êı£¬µ±Ò»¸öudp¶Îµ½´ïÕâ¸öÁ¬½ÓÊ±»á±»µ÷Ó       
****************************************************************************/
udp_server_recv(void *arg, struct udp_pcb *pcb, struct pbuf *p,struct ip_addr *addr, u16_t port)
{
	struct ip_addr destAddr = *addr;  // »ñÈ¡Ô¶³ÌÖ÷»ú IPµØÖ·  
	struct pbuf *p_temp = p;
	//while(p_temp != NULL)
//	{
		udp_sendto(pcb,p_temp,&destAddr,port); // ½«ÊÕµ½µÄÊı¾İÔÙ·¢ËÍ³öÈ¥  
		p_temp = p_temp->next;
//	}
	pbuf_free(p); 						// ÊÍ·Å¸ÃUDP¶Î  
}

/****************************************************************************
* Ãû    ³Æ£ºUDP_server_init(void))
* ¹¦    ÄÜ£ºÍê³ÉUDP·şÎñÆ÷µÄ³õÊ¼»¯£¬Ö÷ÒªÊÇÊ¹µÃUDPÍ¨Ñ¶¿ì½øÈë¼àÌı×´Ì¬
* Èë¿Ú²ÎÊı£º 
* ·µ»Ø²ÎÊı£º 
* Ëµ    Ã÷£º     
****************************************************************************/
void UDP_server_init(void)
{
	struct udp_pcb *pcb;
	pcb = udp_new();							            	// ÉêÇëudp¿ØÖÆ¿é
	udp_bind(pcb,IP_ADDR_ANY,UDP_LOCAL_PORT);   // °ó¶¨±¾µØIPµØÖ·ºÍ¶Ë¿ÚºÅ£¨×÷Îªudp·şÎñÆ÷£© 
	udp_recv(pcb,udp_server_recv,NULL); 			  // ÉèÖÃUDP¶Îµ½Ê±µÄ»Øµ÷º¯Êı */
}


